readme.tex
% Created 2014-12-25 Thu 22:05
\documentclass[9pt,b5paper]{article}
\usepackage{graphicx}
\usepackage{xcolor}
\usepackage{xeCJK}
\setCJKmainfont{SimSun}
\usepackage{longtable}
\usepackage{float}
\usepackage{textcomp}
\usepackage{geometry}
\geometry{left=0cm,right=0cm,top=0cm,bottom=0cm}
\usepackage{multirow}
\usepackage{multicol}
\usepackage{listings}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{latexsym}
\usepackage{natbib}
\usepackage{fancyhdr}
\usepackage[xetex,colorlinks=true,CJKbookmarks=true,linkcolor=blue,urlcolor=blue,menucolor=blue]{hyperref}


\lstset{language=c++,numbers=left,numberstyle=\tiny,basicstyle=\ttfamily\small,tabsize=4,frame=none,escapeinside=``,extendedchars=false,keywordstyle=\color{blue!70},commentstyle=\color{red!55!green!55!blue!55!},rulesepcolor=\color{red!20!green!20!blue!20!}}
\author{Jenny Huang}
\date{\today}
\title{Algorithms Review for Job Interview}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.7c)}}
\begin{document}

\maketitle
\tableofcontents


\section{12/20/2014, Saturday}
\label{sec-1}
\begin{itemize}
\item Website (github), program highlight, and chinese input environment all good now;
\item Will configure Linux Mint Java environment later, prefer emacs;
\item 145/168 done before new season review, begin to work on these questions from today.
\item Just got 4 easiest done: \textbf{149/168}
\begin{itemize}
\item min stack,
\item excel sheet column title,
\item compare version number, and
\item intersection of two linked list,
\end{itemize}
\end{itemize}
\section{12/21/2014, Sunday}
\label{sec-2}
\begin{itemize}
\item Only three got done today: \textbf{152/169}
\begin{itemize}
\item maximum gap
\item fraction to recurring decimal
\item majority element
\end{itemize}
\item Don't feel my mind is clear today at all, will look into job searing instead, hopefully tomorrow I can solve more problems, and slightly complicated ones;
\end{itemize}
\section{12/22/2014, Monday}
\label{sec-3}
\begin{itemize}
\item So far got four done: \textbf{156/169}
\begin{itemize}
\item sort list
\item merge k sorted list
\item trapping rain water
\item recovery binary search tree
\end{itemize}
\item am going to work on the rest 6 tonight, so that hopefully tomorrow I would be able to work on the new 10 questions;
\begin{itemize}
\item \textbf{word ladder II}: spent hours on this one, but got really sick with it! I should have solved my problems gradually, like solve the clone graph to understand graph first before touch this one, but I will get this one done later when I have clear mind.
\item regular expression matching
\item divide two integers
\item clone graph
\item find peak element
\end{itemize}
\end{itemize}
\section{12/23/2014, Tuesday}
\label{sec-4}
\begin{itemize}
\item Meet IPO staff this morning got coming semester plans clear at 8:30am in the morning;
\item Will most probably meet some friend and have dinner together; changed to be \textbf{tomorrow noon}
\item Hopefully by this morning's dirruption meeting staff, I could change back my regular schedule instead of 5am-13:30 day time sleeping, target for tonight fall asleep before 12:00am; fall asleep from 10:00-15:30, seems I will change my schedule back as expected tonight\textasciitilde{}!
\item Will not work on Algorithms for today, but work on it hard tomorrow. I have my confidence that I can figure them out, and do great job summarize the questions during my Java round, no worries!
\item so far Got 2 done: \textbf{158/169}
\begin{itemize}
\item find peak element
\item maximal rectangle
\end{itemize}
\end{itemize}
\section{12/24/2014, Wednesday}
\label{sec-5}
\begin{itemize}
\item 2:00(3:00am?)-11:00am, expect 2:00-9:00am schedule tonight;
\item Don't know why old accound doesn't work any more, use new account; from \textbf{158/169} to \textbf{0/169} using \textbf{Java}
\item Worked on the following questions: \textbf{1/169}
\begin{itemize}
\item divide two integers, just got the Java environment ready
\item regular expression matching: \textbf{working on it!}, require understanding and summarizing
\item 知道猪是怎么死的吗？ \textbf{笨死了\textasciitilde{}~\textasciitilde{}}
\end{itemize}
\end{itemize}
\section{12/25/2014, Thursday}
\label{sec-6}
\begin{itemize}
\item List a detailed plan of working on the algorithms; \textbf{Question Tags} according to the Website:
\end{itemize}
\begin{center}
\begin{tabular}{lrl}
\hline
Tags & Counts & \\
\hline
Heap & 1 & Merge k Sorted Lists\\
Graph & 1 & Clone Graph\\
Data Structure & 3 & \\
Bit Manipulation & 4 & \\
Divide and Conquer & 4 & \\
Greedy & 6 & \\
Sort & 6 & \\
Breadth-first Search & 7 (32) & \\
\hline
Stack & 11 & \\
Binary Search & 13 & \\
Hash Table & 16 & \\
Math & 17 & \\
Linked List & 19 & \\
Depth-first Search & 19 & \\
Backtracking & 21 & \\
Two Pointers & 22 & \\
Dynamic Programming & 23 & \\
Tree & 26 & \\
String & 38 & \\
Array & 56 & \\
\hline
\end{tabular}
\end{center}
\begin{itemize}
\item Detailed Questions:
\end{itemize}
\begin{center}
\begin{tabular}{lrrllll}
\hline
Tags & Counts & \# & Title & Acceptance & Difficulty & Notes\\
\hline
Heap & 1 & 23 & Merge k Sorted Lists & 21.0\% & Hard & \\
Graph & 1 & 133 & Clone Graph & 23.3\% & Medium & \\
\hline
Data Structure & 3 & 170 & Two Sum III - Data structure design & 19.2\% & Easy & \\
 &  & 155 & Min Stack & 14.6\% & Easy & \\
 &  & 146 & LRU Cache & 14.3\% & Hard & \\
\hline
Bit Manipulation & 4 & 78 & Subsets & 27.9\% & Medium & \\
 &  & 136 & Single Number & 46.0\% & Medium & \\
 &  & 137 & Single Number II & 34.0\% & Medium & \\
 &  & 169 & Majority Element & 31.6\% & Easy & \\
\hline
Divide and Conquer & 4 & 23 & Merge k Sorted Lists & 21.0\% & Hard & \\
 &  & 4 & Median of Two Sorted Arrays & 17.6\% & Hard & \\
 &  & 53 & Maximum Subarray & 34.2\% & Medium & \\
 &  & 169 & Majority Element & 31.7\% & Easy & \\
\hline
Greedy & 6 & 44 & Wildcard Matching & 14.6\% & Hard & \\
 &  & 55 & Jump Game & 27.2\% & Medium & \\
 &  & 45 & Jump Game II & 24.6\% & Hard & \\
 &  & 134 & Gas Station & 26.0\% & Medium & \\
 &  & 135 & Candy & 19.5\% & Hard & \\
 &  & 122 & Best Time to Buy and Sell Stock II & 37.0\% & Medium & \\
\hline
Sort & 6 & 148 & Sort List & 20.9\% & Medium & \\
 &  & 75 & Sort Colors & 32.3\% & Medium & \\
 &  & 56 & Merge Intervals & 21.2\% & Hard & \\
 &  & 164 & Maximum Gap & 23.1\% & Hard & \\
 &  & 147 & Insertion Sort List & 25.5\% & Medium & \\
 &  & 57 & Insert Interval & 20.7\% & Hard & \\
\hline
Breadth-first Search & 7 (32) & 127 & Word Ladder & 18.4\% & Medium & \\
 &  & 126 & Word Ladder II & 11.8\% & Hard & \\
 &  & 130 & Surrounded Regions & 14.3\% & Medium & \\
 &  & 133 & Clone Graph & 23.3\% & Medium & \\
 &  & 103 & Binary Tree Zigzag Level Order Traversal & 26.5\% & Medium & \\
 &  & 102 & Binary Tree Level Order Traversal & 29.9\% & Easy & \\
 &  & 107 & Binary Tree Level Order Traversal II & 30.4\% & Easy & \\
\hline
 &  &  &  &  &  & \\
\end{tabular}
\end{center}
% Emacs 24.3.1 (Org mode 8.2.7c)
\end{document}